Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [4]:
data=[4,8,15,16,23,45]
s=pd.Series(data)

In [5]:
s

0     4
1     8
2    15
3    16
4    23
5    45
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

In [6]:
import pandas as pd

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
s1 = pd.Series(my_list)
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [29]:
import pandas as pd
data={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df1=pd.DataFrame(data)

In [30]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a 2-dimensional labeled data structure that can hold data of different types in columns. It is similar to a spreadsheet or a SQL table. Each column of a DataFrame can be considered as a Series object.

The main difference between a DataFrame and a Series is that a DataFrame is a 2-dimensional data structure, whereas a Series is a 1-dimensional data structure. A Series can be considered as a single column of a DataFrame. A Series has only one axis labeled as index, whereas a DataFrame has two axes labeled as index and columns.

Here's an example to illustrate the difference between a DataFrame and a Series:

In [26]:
import pandas as pd

# create a Series
s = pd.Series([1, 2, 3, 4, 5], name='numbers')

# create a DataFrame with the same data as the Series
df = pd.DataFrame({'numbers': [1, 2, 3, 4, 5]})

# add another column to the DataFrame
df['letters'] = ['a', 'b', 'c', 'd', 'e']

# print the Series and the DataFrame
print(s)
print(df)

0    1
1    2
2    3
3    4
4    5
Name: numbers, dtype: int64
   numbers letters
0        1       a
1        2       b
2        3       c
3        4       d
4        5       e

In this example, we create a Series named 'numbers' with 5 integer values. We also create a DataFrame with the same data as the Series by passing a dictionary with one key named 'numbers' and its value as a list of 5 integers. Then we add another column to the DataFrame named 'letters' with 5 string values.

As we can see from the output, the Series has only one column named 'numbers' with its index labeled from 0 to 4. The DataFrame, on the other hand, has two columns named 'numbers' and 'letters' with its index labeled from 0 to 4. We can also see that the Series has a name for the column, whereas the DataFrame has names for both columns. We can access a single column from the DataFrame by using its column name as a key.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some common functions:

head() and tail(): These functions are used to view the top and bottom n rows of a DataFrame, respectively. For example, df.head(10) will display the first 10 rows of a DataFrame df.

info(): This function is used to display the concise summary of a DataFrame, including the data types of each column and the number of non-null values.

describe(): This function is used to generate descriptive statistics of a DataFrame, such as count, mean, standard deviation, and quartiles.

groupby(): This function is used to group data in a DataFrame based on one or more columns. For example, df.groupby('column_name').mean() will group the data in a DataFrame df by the values in 'column_name' and calculate the mean of each group.

sort_values(): This function is used to sort the rows of a DataFrame based on one or more columns. For example, df.sort_values('column_name') will sort the rows of a DataFrame df in ascending order based on the values in 'column_name'.

fillna(): This function is used to replace missing values in a DataFrame with a specified value. For example, df.fillna(0) will replace all missing values in a DataFrame df with 0.

drop(): This function is used to drop rows or columns from a DataFrame based on specified labels. For example, df.drop(['column1', 'column2'], axis=1) will drop the columns 'column1' and 'column2' from a DataFrame df.

In [33]:
df.head(3)

   numbers letters
0        1       a
1        2       b
2        3       c

In [34]:
df.tail(2)

   numbers letters
3        4       d
4        5       e

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable, while Panel is considered deprecated since version 0.25.0 of pandas and has been replaced by the more versatile MultiIndex.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [38]:
s1 = pd.Series([10, 20, 30, 40, 50])
s2 = pd.Series(['apple', 'banana', 'orange', 'kiwi', 'grape'])
df2 = pd.DataFrame({'numbers': s1, 'fruits': s2})

In [39]:
df2

   numbers  fruits
0       10   apple
1       20  banana
2       30  orange
3       40    kiwi
4       50   grape